app/views/games/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."game_id" = $1  [["game_id", 321]]
---
<h2>Comments</h2>
<% @game.comments.each do |comment| %>