app/controllers/comments_controller.rb

INSERT INTO "comments" ("user_id", "game_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["game_id", 0], ["body", "asdasd"], ["created_at", 2017-02-16 00:51:14 UTC], ["updated_at", 2017-02-16 00:51:14 UTC]]
SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
	def create
		new_comment = Comment.new(comment_params)
		new_comment.user_id = 1
		new_comment.save
		game = Game.find_by_id(new_comment.game_id)