app/controllers/games_controller.rb

SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 321], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
	def show
		@game = Game.find_by_id(params[:id])
		@current_user = User.find_by_id(session[:user_id])