app/controllers/user_games_controller.rb

INSERT INTO "user_games" ("user_id", "game_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 9], ["game_id", 321], ["created_at", 2017-02-16 16:13:32 UTC], ["updated_at", 2017-02-16 16:13:32 UTC]]
SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 321], ["LIMIT", 1]]
---
  def create
    user_game = UserGame.create(user_id: session[:user_id], game_id: params["game_id"].to_i  )
    game = Game.find_by_id(user_game.game_id)